Revit 2024 API
FilterNumericLess.Evaluate Method
Overload List
Name | Description
Evaluate(Int32, Int32) |  Obsolete.
 Derived classes should override this method to implement the desired test.
 (Inherited from FilterNumericRuleEvaluator.)
Evaluate(Int64, Int64)
 Derived classes should override this method to implement the desired test.
 (Inherited from FilterNumericRuleEvaluator.)
Evaluate(Double, Double, Double)
 Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not.
 (Inherited from FilterNumericRuleEvaluator.)
See Also
FilterNumericLess Class
FilterNumericLess Members
Autodesk.Revit.DB Namespace